Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # module.ollama.helm_release.openwebui will be updated in-place
~ resource "helm_release" "openwebui" {
      ~ id                         = "open-webui" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "0.6.18" -> (known after apply)
          ~ chart          = "open-webui" -> (known after apply)
          ~ first_deployed = 1746062409 -> (known after apply)
          ~ last_deployed  = 1753315423 -> (known after apply)
          ~ name           = "open-webui" -> (known after apply)
          ~ namespace      = "open-webui" -> (known after apply)
          ~ notes          = <<-EOT
                🎉 Welcome to Open WebUI!!
                 ██████╗ ██████╗ ███████╗███╗   ██╗    ██╗    ██╗███████╗██████╗ ██╗   ██╗██╗
                ██╔═══██╗██╔══██╗██╔════╝████╗  ██║    ██║    ██║██╔════╝██╔══██╗██║   ██║██║
                ██║   ██║██████╔╝█████╗  ██╔██╗ ██║    ██║ █╗ ██║█████╗  ██████╔╝██║   ██║██║
                ██║   ██║██╔═══╝ ██╔══╝  ██║╚██╗██║    ██║███╗██║██╔══╝  ██╔══██╗██║   ██║██║
                ╚██████╔╝██║     ███████╗██║ ╚████║    ╚███╔███╔╝███████╗██████╔╝╚██████╔╝██║
                 ╚═════╝ ╚═╝     ╚══════╝╚═╝  ╚═══╝     ╚══╝╚══╝ ╚══════╝╚═════╝  ╚═════╝ ╚═╝
                
                v0.6.18 - building the best open-source AI user interface.
                 - Chart Version: v6.28.0
                 - Project URL 1: https://www.openwebui.com/
                 - Project URL 2: https://github.com/open-webui/open-webui
                 - Documentation: https://docs.openwebui.com/
                 - Chart URL: https://github.com/open-webui/helm-charts
                
                Open WebUI is a web-based user interface that works with Ollama, OpenAI, Claude 3, Gemini and more.
                This interface allows you to easily interact with local AI models.
                
                1. Deployment Information:
                  - Chart Name: open-webui
                  - Release Name: open-webui
                  - Namespace: open-webui
                
                2. Access the Application:
                  Access via ClusterIP service:
                
                    export LOCAL_PORT=8080
                    export POD_NAME=$(kubectl get pods -n open-webui -l "app.kubernetes.io/component=open-webui" -o jsonpath="{.items[0].metadata.name}")
                    export CONTAINER_PORT=$(kubectl get pod -n open-webui $POD_NAME -o jsonpath="{.spec.containers[0].ports[0].containerPort}")
                    kubectl -n open-webui port-forward $POD_NAME $LOCAL_PORT:$CONTAINER_PORT
                    echo "Visit http://127.0.0.1:$LOCAL_PORT to use your application"
                
                  Then, access the application at: http://127.0.0.1:$LOCAL_PORT or http://localhost:8080
                
                3. Useful Commands:
                  - Check deployment status:
                      helm status open-webui -n open-webui
                
                  - Get detailed information:
                      helm get all open-webui -n open-webui
                
                  - View logs:
                      kubectl logs -f statefulset/open-webui -n open-webui
                
                4. Cleanup:
                  - Uninstall the deployment:
                      helm uninstall open-webui -n open-webui
            EOT -> (known after apply)
          ~ revision       = 24 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - enableOpenaiApi = false
                  - extraEnvVars    = [
                      - {
                          - name  = "ENABLE_LOGIN_FORM"
                          - value = "\"false\""
                        },
                      - {
                          - name  = "DEFAULT_USER_ROLE"
                          - value = "user"
                        },
                      - {
                          - name  = "ENABLE_PERSISTENT_CONFIG"
                          - value = "\"false\""
                        },
                      - {
                          - name  = "WEBUI_URL"
                          - value = "https://ollama.billv.ca"
                        },
                    ]
                  - ollama          = {
                      - enabled = false
                    }
                  - ollamaUrls      = [
                      - "http://ollama.ollama.svc.cluster.local:11434",
                    ]
                  - sso             = {
                      - enableRoleManagement = true
                      - enableSignup         = true
                      - enabled              = true
                      - oidc                 = {
                          - clientId     = "M721cM1UUVz1ne3es7e6"
                          - clientSecret = "(sensitive value)"
                          - enabled      = true
                          - providerName = "Authentik"
                          - providerUrl  = "https://auth.billv.ca/application/o/ollama/.well-known/openid-configuration"
                        }
                      - roleManagement       = {
                          - adminRoles   = "Ollama_Admins"
                          - allowedRoles = "Ollama_Users"
                          - rolesClaim   = "groups"
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "6.28.0" -> (known after apply)
        } -> (known after apply)
        name                       = "open-webui"
      ~ version                    = "6.28.0" -> "6.29.0"
        # (28 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.billv.ca/lock?id=billv-ca%252Fhomelab-atlantis-k3s-services%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```